import string
import random

names = [
    "Олександр", "Ірина", "Андрій", "Юлія", "Максим", "Олена", "Дмитро", "Катерина", 
    "Віталій", "Наталія", "Сергій", "Марія", "Іван", "Анна", "Михайло", "Тетяна", 
    "Володимир", "Оксана", "Роман", "Софія", "Богдан", "Вікторія", "Ярослав", "Людмила", 
    "Артем", "Аліна", "Євген", "Дарія", "Павло", "Христина", "Олег", "Лілія", 
    "Ігор", "Вероніка", "Василь", "Марина", "Станіслав", "Ольга", "Тарас", "Зоряна", 
    "Лев", "Яна", "Ростислав", "Емілія", "Матвій", "Світлана", "Захар", "Ксенія", 
    "Григорій", "Надія"
]

surnames = [
    "Ковальчук", "Шевченко", "Бондаренко", "Ткаченко", "Кравець", "Олійник", 
    "Лисенко", "Мельник", "Савчук", "Зінченко", "Пономаренко", "Дорошенко", 
    "Гнатюк", "Степаненко", "Романюк", "Козак", "Мазур", "Клименко", 
    "Левченко", "Павлюк", "Сидоренко", "Микитюк", "Гаврилюк", "Костенко", 
    "Шаповал", "Федорук", "Чорний", "Яремчук", "Пилипенко", "Гордієнко", 
    "Семенюк", "Дубовий", "Терещенко", "Лозовий", "Кравчук", "Савка", 
    "Білик", "Гуменюк", "Шевчук", "Мельничук", "Руденко", "Вовк", 
    "Кушнір", "Стадницький", "Данилюк", "Бойко", "Москаленко", "Герасимчук", 
    "Коваль", "Петренко"
]

def gen_email():
    random_string = ''.join(random.choices(string.ascii_letters, k=12))
    random_email = random.choice(['@gmail.com',"@outlook.com","@live.com","@online.ua"])
    return(f'{random_string}{random_email}')